
# username = input("Введите имия: ")
# if username == 'Маша':
#     print("Ура! Это же Маша!")
# elif username == 'Марина':
#     print('Я так ждала вас,Марина!')
# elif username == 'Ильнар':
#     print("Ильнар - топ")
# else:
#     print("Привет"  , username)

# line = ""
# for i in range(5):
#     line = ""
#     for j in range(5):
#         line += "*"
#     print(line)


# text = "Съещ еще этих МяГкиХ французких булок"
# print(len(text)) # Функция "len" определяет количество буков в строке.


# text = "Съещ еще этих МяГкиХ французких булок"
# print('еще' in text)   # определяет есть ли слова "еще" в тексте.


# text = "Съещ еще этих МяГкиХ французких булок"
# print(text.lower()) # Функция "lower" позваляет перевести все букви строке в нижный регистр. 


# text = "Съещ еще этих МяГкиХ французких булок"
# print(text.upper())   # Функция "upper" позваляет поднят все буквы в строке вверхный регистр.


text = "Съещ еще этих МяГкиХ французких булок"
print(text.replace('еще','ЕЩЕ')) 








